In [1]:
import pandas as pd
name=['Ayush','Komal','Shayam']
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [2]:
import pandas as pd
name=['Ayush','Komal','Shayam']
pd.DataFrame(name)

        0
0   Ayush
1   Komal
2  Shayam

In [3]:
import pandas as pd
name=['Ayush','Komal','Shayam']
age=[20,30,35]
pd.DataFrame(zip(name,age))

        0   1
0   Ayush  20
1   Komal  30
2  Shayam  35

In [5]:
import pandas as pd
name=['Ayush','Komal','Shayam']
age=[20,30,35]
city=['Hyd','Blr','Pune']
pd.DataFrame(zip(name,age,city))

        0   1     2
0   Ayush  20   Hyd
1   Komal  30   Blr
2  Shayam  35  Pune

In [9]:
import pandas as pd
name=['Ayush','Komal','Shayam']
age=[20,30,35]
city=['Hyd','Blr','Pune']
data=zip(name,age,city)
cols=['Name','Age','City']
df=pd.DataFrame(data,columns=cols)

In [10]:
type(df)

pandas.core.frame.DataFrame

In [18]:
salary=[20000,30000,50000]
df['Salary']=salary
df

     Name  Age  City job Job  Salary
0   Ayush   20   Hyd  DS  DS   20000
1   Komal   30   Blr  DA  DA   30000
2  Shayam   35  Pune  CS  CS   50000

In [19]:
df['Age']=[30,40,50]
df

     Name  Age  City job Job  Salary
0   Ayush   30   Hyd  DS  DS   20000
1   Komal   40   Blr  DA  DA   30000
2  Shayam   50  Pune  CS  CS   50000

In [21]:
import pandas as pd
name=['Ayush','Komal','Shayam']
age=[20,30,35]
city=['Hyd','Blr','Pune']
data=zip(name,age,city)
cols=['Name','Age','City']
idx=['A','B','C']
df=pd.DataFrame(data,index=idx,columns=cols)
df

     Name  Age  City
A   Ayush   20   Hyd
B   Komal   30   Blr
C  Shayam   35  Pune

In [24]:
df.shape
print("The number of rows:",df.shape[0])

The number of rows: 3